Repository: common-repository/selectel-storage-upload
Catalog: lang/selupload-*.po
Languages: ru_ru

source: Connection is successfully established. Save the settings.
ru_ru: Соединение успешно установлено. Сохраните настройки.

source: Connection is not established.
ru_ru: Не удалось подключиться к контейнеру.

source: Impossible to upload a file
ru_ru: Невозможно загрузить файл

source: Do not have access to the file
ru_ru: Файл не существует или недоступен для чтения

source: Unable to connect to the container
ru_ru: Не удается подключиться к контейнеру

source: Data empty
ru_ru: Данные пустые

source: Settings
ru_ru: Настройки

source: Type the information for access to your container.
ru_ru: Введите информацию для доступа к вашему контейнеру.

source: No account? <a href ="http://goo.gl/8Z0q8H">Sign up</a>
ru_ru: Нет аккаунта? <a href ="http://goo.gl/8Z0q8H">Зарегистрироваться</a>

source: Username
ru_ru: Имя пользователя

source: Password
ru_ru: Пароль

source: Container
ru_ru: Контейнер

source: Check the connection
ru_ru: Проверить соединение

source: Local path
ru_ru: Локальный путь

source: Local path to the uploaded files. By default
ru_ru: Локальный путь к загружаемым файлам. По умолчанию

source: Setting duplicates of the same name from the mediafiles settings. Changing one, you change and other
ru_ru: Настройка дублирует одноименную настройку в медиафайлах. Изменяя одну, вы изменяете и другую.

source: Full URL-path to files
ru_ru: Полный URL-путь к файлам

source: Enter the domain or subdomain if store files only in the Selectel Storage
ru_ru: Введите адрес домена/поддомена, если файлы хранятся только в Selectel Storage

source: or full url path, if only used synchronization
ru_ru: или полный Url адрес, если используется только синхронизация

source: Prefix the path in the storage
ru_ru: Префикс пути для фалов в хранилище

source: The path to the file in the storage will appear as a prefix / path.<br />For example, in your case:
ru_ru: Путь к файлам в хранилище будет выглядеть как: префикс/путь к файлам.<br />Например, в вашем случае:

source: Authorization server
ru_ru: Сервер авторизации

source: By default
ru_ru: По умолчанию

source: Mask files
ru_ru: Маска файлов

source: for all files, 2 or more values separated by a comma (for example:
ru_ru: для всех файлов, 2 и более значения разделяются запятой (например:

source: Synchronization settings
ru_ru: Настройки синхронизации

source: Store files only in the Selectel Storage
ru_ru: Хранить файлы только в Selectel Storage

source: to attach a domain / subdomain to store and specify the settings
ru_ru: чтобы не было "битых" ссылок необходимо прикрепить домен / поддомен к контейнеру в Selectel Storage и указать его в настройках

source: The file will be deleted from the hosting after a successful download. It will only copy in the Selectel Storage
ru_ru: Файл будет удален на хостинге после успешной загрузки. Его копия останется только в Selectel Storage

source: Delete files from the Selectel Storage if they are removed from the library
ru_ru: Удалять файлы из Selectel Storage, если они были удалены из библиотеки

source: Deferred upload files
ru_ru: Отложенная выгрузка файлов.

source: Files are uploaded to the delay. It protects against errors when uploading large files.
ru_ru: Файлы выгружаются в хранилище с задержкой. Защищает от ошибок при выгрузке больших файлов.

source: Do not overwrite the file if it already exists in the storage
ru_ru: Не перезаписывать файл, если он уже есть в хранилище

source: Enable debug mode. Do not enable unless you know what it is.
ru_ru: Включить режим отладки. Не включайте, если не знаете зачем это.

source: Full synchronization
ru_ru: Полная синхронизация

source: Show the list of files to synchronize
ru_ru: Файлы для синхронизации

source: !WARNING! Full synchronization is not designed to synchronize a huge number of files. Firstly, it takes a lot of time, and secondly it will lead to an increase in the load on the server that might cause authorization of the host. With a large number of files is recommended that you synchronize files manually via FTP, and then use this plugin to sync.
ru_ru: !ВНИМАНИЕ! Полная синхронизация не предназначена для синхронизации огромного количества файлов. Во-первых, это займёт довольно много времени, во-вторых это приведет к росту нагрузки на сервер, что может вызвать санкции со стороны хостинга. При большом количестве файлов рекомендуется сначала синхронизировать файлы через FTP вручную, а затем уже использовать этот плагин для синхронизации в автоматическом режиме вновь добавляемых файлов.

source: You can always help the development of plug-in and contribute to the emergence of new functionality.
ru_ru: Вы всегда можете помочь развитию плагина и способствовать появлению новой функциональности.

source: If you have any ideas or suggestions
ru_ru: Если у вас есть идеи или предложения

source: contact the author
ru_ru: связаться с автором

source: You can always thank the author of financially.
ru_ru: Вы всегда можете поблагодарить автора материально.

source: Yandex.Money
ru_ru: Яндекс.Деньги

source: Plugin Selectel Cloud Uploader requires PHP 5.3.3 or higher. The plugin has now disabled itself.
ru_ru: Для работы плагина Selectel Cloud Upload необходимо, чтобы версия PHP была не ниже 5.3.3. Плагин сейчас отключен.

source: Plugin Selectel Cloud Uploader requires cURL 7.16.2+. The plugin has now disabled itself.
ru_ru: Для работы плагина Selectel Cloud Upload необходимо, чтобы версия cURL была не ниже 7.16.2+. Плагин сейчас отключен.

source: Plugin Selectel Cloud Uploader requires that cURL is compiled with OpenSSL. The plugin has now disabled itself.
ru_ru: Для работы плагина Selectel Cloud Upload необходимо, чтобы cURL был скомпилирован с поддержкой OpenSSL. Плагин сейчас отключен.
